//
//	Billboard.h
//		Author:	DATE:
//===============================================
//	変更者 Changed By
//		Name:	DATE:
//
//-----------------------------------------------

#pragma once
#ifndef BILLBOARD_H
#define BILLBOARD_H

//================================================
//	インクルード	include
//================================================
#include"common.h"
#include<d3dx9.h>

#include"CTransform.h"
//================================================
//	マクロ定義	define
//================================================


//================================================
//	列挙型		enum
//================================================


//================================================
//	構造体		struct/typedef
//================================================


//================================================
//	グローバル変数　global
//================================================


//================================================
//	クラス
//================================================

//-------------------------------------
//	抽象クラス
//-------------------------------------
class ABillboard
{
public:
	ABillboard();
};

//-------------------------------------
//	Billboard
//-------------------------------------
class CBillboard
{
public:
	Transform transform;		//情報

public:
	//コンストラクタ
	CBillboard();

	//デストラクタ
	~CBillboard();

public:
	void Upadte();
	void Render();
};

//================================================
//	関数		function
//================================================
void Billboard_Initialize();
void BillBoard_Create(D3DXVECTOR3 position);
void BillBoard_Create(Transform* pTransform);
void BillBoard_Finalaize();

#endif