//
//	MeshField_SkyDome.h
//		Author:HIROMASA IKEDA	DATE:2018/10/26
//===============================================
//	変更者 Changed By
//		Name:	DATE:
//
//-----------------------------------------------

#pragma once
#ifndef MESHFIELD_SKYDORM_H
#define MESHFIELD_SKYDORM_H

//================================================
//	インクルード	include
//================================================
#include"common.h"
#include<d3dx9.h>
#include"Texture.h"

//================================================
//	マクロ定義	define
//================================================


//================================================
//	列挙型		enum
//================================================


//================================================
//	構造体		struct/typedef
//================================================


//================================================
//	グローバル変数　global
//================================================


//================================================
//	関数		function
//================================================
void MeshSkyDome_Initialize();
void MeshSkyDome_Render(const D3DXVECTOR3 Center, TEXTURE_NAME Texture);
void MeshSkyDome_Finalize();

#endif