//
//	WinSock.h
//		Author:HIROMASA IKEDA	DATE:2018/11/03
//===============================================
//	変更者 Changed By
//		Name:	DATE:
//
//-----------------------------------------------

#pragma once
#ifndef WINSOCK_H
#define WINSOCK_H

//================================================
//	インクルード	include
//================================================
#include"common.h"
#include<d3dx9.h>

//================================================
//	マクロ定義	define
//================================================


//================================================
//	列挙型		enum
//================================================


//================================================
//	構造体		struct/typedef
//================================================


//================================================
//	グローバル変数　global
//================================================


//================================================
//	関数		function
//================================================
LRESULT CALLBACK WinSockPoc(HWND hWnd, UINT uMsg, WPARAM wParam, LPARAM lParam);

void WinSock_Window(HINSTANCE hInstance, HWND hParent);
void WindSock_SetWindow(BOOL Show);
TCHAR* WinSock_Receiver();
void WinSock_Send(char* SendMsg);

#endif